RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MKL13Z644/fsl_clock_MKL13Z644.c
    src = CLOCK_HAL_GetLpuartSrc(SIM, instance);

    switch (src)
    {
        case kClockLpuartSrcIrc48M:	  /* IRC48M */
            freq = kMcgliteConst48M;
            break;
        case kClockLpuartSrcOsc0erClk:		/* OSCER clock */
            freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
            break;
        case kClockLpuartSrcMcgIrClk:		/* MCGIR clock */
            freq = CLOCK_HAL_GetInternalRefClk(MCG);
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetLptmrFreq
 * Description   : Gets LPTMRx pre-scaler/glitch filter clock frequency.
 * This function gets the LPTMRx pre-scaler/glitch filter clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetLptmrFreq(uint32_t instance, clock_lptmr_src_t lptmrSrc)
{
    uint32_t freq;

    switch (lptmrSrc)
    {
        case kClockLptmrSrcMcgIrClk:        /* MCG out clock  */
            freq = CLOCK_HAL_GetInternalRefClk(MCG);
            break;
        case kClockLptmrSrcLpoClk:             /* LPO clock     */
            freq = CLOCK_SYS_GetLpoClockFreq();
            break;
        case kClockLptmrSrcEr32kClk:        /* ERCLK32K clock */
            freq = CLOCK_SYS_GetExternalRefClock32kFreq();
            break;
        case kClockLptmrSrcOsc0erClk:        /* OSCERCLK clock */
            freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_GetTpmExternalFreq
* Description	 : Gets Tpm external clock frequency.
*
*END**************************************************************************/
uint32_t CLOCK_SYS_GetTpmExternalFreq(uint32_t instance)
{
    sim_tpm_clk_sel_t sel = SIM_HAL_GetTpmExternalClkPinSelMode(SIM, instance);

    if (kSimTpmClkSel0 == sel)
    {
        return g_tpmClkFreq[0];
    }
    else
    {
        return g_tpmClkFreq[1];
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFlexioFreq
 * Description   : Gets the clock frequency for FLEXIO.
 * This function gets the clock frequency for FLEXIO.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetFlexioFreq(uint32_t instance)
{
    uint32_t freq;
    clock_flexio_src_t src = CLOCK_HAL_GetFlexioSrc(SIM, instance);

    switch (src)
    {
        case kClockFlexioSrcIrc48M:
            freq = kMcgliteConst48M;
            break;
        case kClockFlexioSrcOsc0erClk:
            freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
            break;
        case kClockFlexioSrcMcgIrClk:
            freq = CLOCK_HAL_GetInternalRefClk(MCG);
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSpiFreq
 * Description   : Gets the clock frequency for SPI.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetSpiFreq(uint32_t instance)
{
    assert(instance < SPI_INSTANCE_COUNT);

    if (0U == instance)
    {
        return CLOCK_SYS_GetBusClockFreq();
    }
    else
    {
        return CLOCK_SYS_GetSystemClockFreq();
    }
}

/* PORT instance table. */
static sim_clock_gate_name_t portGateTable[] =
{
    kSimClockGatePortA,
    kSimClockGatePortB,
    kSimClockGatePortC,
    kSimClockGatePortD,
    kSimClockGatePortE
};

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_EnablePortClock
* Description   : Enable the clock for PORT module
* This function enables the clock for PORT moudle
*
*END**************************************************************************/
void CLOCK_SYS_EnablePortClock(uint32_t instance)
{
    assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

    SIM_HAL_EnableClock(SIM, portGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_DisablePortClock
* Description   : Disable the clock for PORT module
* This function disables the clock for PORT moudle
*
*END**************************************************************************/
void CLOCK_SYS_DisablePortClock(uint32_t instance)
{
    assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

    SIM_HAL_DisableClock(SIM, portGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_GetPortGateCmd
* Description   : Get the the clock gate state for PORT module
* This function will get the clock gate state for PORT moudle.
*
*END**************************************************************************/
bool CLOCK_SYS_GetPortGateCmd(uint32_t instance)
{
    assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, portGateTable[instance]);
}

/* ADC instance table. */
static sim_clock_gate_name_t adcGateTable[] =
{
    kSimClockGateAdc0,
};

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_EnableAdcClock
* Description   : Enable the clock for ADC module
* This function enables the clock for ADC moudle
*
*END**************************************************************************/
void CLOCK_SYS_EnableAdcClock(uint32_t instance)
{
    assert(instance < sizeof(adcGateTable)/sizeof(adcGateTable[0]));

    SIM_HAL_EnableClock(SIM, adcGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_DisableAdcClock
* Description   : Disable the clock for ADC module
* This function disables the clock for ADC moudle
*
*END**************************************************************************/
void CLOCK_SYS_DisableAdcClock(uint32_t instance)
{
    assert(instance < sizeof(adcGateTable)/sizeof(adcGateTable[0]));

