RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MKL13Z644/fsl_clock_MKL13Z644.c
    SIM_HAL_DisableClock(SIM, adcGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_GetAdcGateCmd
* Description   : Get the the clock gate state for ADC module
* This function will get the clock gate state for ADC moudle.
*
*END**************************************************************************/
bool CLOCK_SYS_GetAdcGateCmd(uint32_t instance)
{
    assert(instance < sizeof(adcGateTable)/sizeof(adcGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, adcGateTable[instance]);
}

/* DAC instance table. */
static const sim_clock_gate_name_t dacGateTable[] =
{
    kSimClockGateDac0
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableDacClock
 * Description   : Enable the clock for DAC module
 * This function enables the clock for DAC moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableDacClock(uint32_t instance)
{
    assert(instance < sizeof(dacGateTable)/sizeof(dacGateTable[0]));

    SIM_HAL_EnableClock(SIM, dacGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableDacClock
 * Description   : Disable the clock for DAC module
 * This function disables the clock for DAC moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableDacClock(uint32_t instance)
{
    assert(instance < sizeof(dacGateTable)/sizeof(dacGateTable[0]));

    SIM_HAL_DisableClock(SIM, dacGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetDacGateCmd
 * Description   : Get the the clock gate state for DAC module
 * This function will get the clock gate state for DAC moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetDacGateCmd(uint32_t instance)
{
    assert(instance < sizeof(dacGateTable)/sizeof(dacGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, dacGateTable[instance]);
}

/* SPI instance table. */
static sim_clock_gate_name_t spiGateTable[] =
{
    kSimClockGateSpi0,
    kSimClockGateSpi1,
};

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_EnableSpiClock
* Description   : Enable the clock for SPI module
* This function enables the clock for SPI moudle
*
*END**************************************************************************/
void CLOCK_SYS_EnableSpiClock(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    SIM_HAL_EnableClock(SIM, spiGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_DisableSpiClock
* Description   : Disable the clock for SPI module
* This function disables the clock for SPI moudle
*
*END**************************************************************************/
void CLOCK_SYS_DisableSpiClock(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    SIM_HAL_DisableClock(SIM, spiGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_GetSpiGateCmd
* Description   : Get the the clock gate state for SPI module
* This function will get the clock gate state for SPI moudle.
*
*END**************************************************************************/
bool CLOCK_SYS_GetSpiGateCmd(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, spiGateTable[instance]);
}

/* I2C instance table. */
static sim_clock_gate_name_t i2cGateTable[] =
{
    kSimClockGateI2c0,
    kSimClockGateI2c1,
};

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_EnableI2cClock
* Description   : Enable the clock for I2C module
* This function enables the clock for I2C moudle
*
*END**************************************************************************/
void CLOCK_SYS_EnableI2cClock(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    SIM_HAL_EnableClock(SIM, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_DisableI2cClock
* Description   : Disable the clock for I2C module
* This function disables the clock for I2C moudle
*
*END**************************************************************************/
void CLOCK_SYS_DisableI2cClock(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    SIM_HAL_DisableClock(SIM, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_GetI2cGateCmd
* Description   : Get the the clock gate state for I2C module
* This function will get the clock gate state for I2C moudle.
*
*END**************************************************************************/
bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, i2cGateTable[instance]);
}

/* Lpuart instance table. */
static sim_clock_gate_name_t lpuartGateTable[] =
{
    kSimClockGateLpuart0,
    kSimClockGateLpuart1
};

/*FUNCTION**********************************************************************
*
* Function Name : SIM_HAL_EnableLpuartClock
* Description   : Enable the clock for UART module
* This function enables the clock for UART moudle
*
*END**************************************************************************/
void CLOCK_SYS_EnableLpuartClock(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    SIM_HAL_EnableClock(SIM, lpuartGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : SIM_HAL_DisableLpuartClock
* Description   : Disable the clock for UART module
* This function enables the clock for UART moudle
*
*END**************************************************************************/
void CLOCK_SYS_DisableLpuartClock(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    SIM_HAL_DisableClock(SIM, lpuartGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : SIM_HAL_GetLpuartGateCmd
* Description   : Get the the clock gate state for UART module
* This function will get the clock gate state for UART moudle.
*
*END**************************************************************************/
bool CLOCK_SYS_GetLpuartGateCmd(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, lpuartGateTable[instance]);
}

/* TPM instance table. */
static sim_clock_gate_name_t tpmGateTable[] =
{
    kSimClockGateTpm0,
    kSimClockGateTpm1,
    kSimClockGateTpm2,
};

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_EnableTpmClock
* Description	 : Enable the clock for TPM module
* This function enables the clock for TPM moudle
*
*END**************************************************************************/
void CLOCK_SYS_EnableTpmClock(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    SIM_HAL_EnableClock(SIM, tpmGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_DisableTpmClock
* Description	 : Disable the clock for TPM module
* This function disables the clock for TPM moudle
*
*END**************************************************************************/
void CLOCK_SYS_DisableTpmClock(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    SIM_HAL_DisableClock(SIM, tpmGateTable[instance]);
}

/*FUNCTION**********************************************************************
*
* Function Name : CLOCK_SYS_GetTpmGateCmd
* Description	 : Get the the clock gate state for TPM module
* This function will get the clock gate state for TPM moudle.
*
*END**************************************************************************/
bool CLOCK_SYS_GetTpmGateCmd(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, tpmGateTable[instance]);
}

/*******************************************************************************
* EOF
******************************************************************************/
